Alex-Ws-Ax/dap-ch552/DAP/Main_Usb.C
    while (!UsbConfig) {;};

    while (1)
    {
        DAP_Thread();

        if (Endp3Busy != 1 && Ep3Ii != Ep3Io)
        {
            Endp3Busy = 1;
            UEP3_T_LEN = Ep3Is[0];//Ep3Io>>6];
            UEP3_DMA_L = Ep3Io;
            
            UEP3_CTRL = UEP3_CTRL & ~MASK_UEP_T_RES | UEP_T_RES_ACK; //有数据时上传数据并应答ACK
            Ep3Io += 64;
        }

        if (USBByteCount)
        {
            CH552UART1SendByte(Ep1BufferO[USBBufOutPoint++]);
            USBByteCount--;
            if (USBByteCount == 0)
                UEP1_CTRL = UEP1_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;
        }
        if (UartByteCount)
        {
            Uart_Timeout++;
            if (UartByteCount > 39 || Uart_Timeout > 100)
            {
                if (!Endp1Busy)
                {
                    Uart_Timeout = 0;
                    UEP1_T_LEN = UartByteCount;                                                    //预使用发送长度一定要清空
                    UEP1_CTRL = UEP1_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK;            //应答ACK
                    Endp1Busy = 1;
                    UartByteCount = 0;
                    Uart_Input_Point = 0;
                }
            }
        }
    }
}

void Config_Uart1(UINT8 *cfg_uart)
{
    UINT32 uart1_buad = 0;
    *((UINT8 *)&uart1_buad) = cfg_uart[3];
    *((UINT8 *)&uart1_buad + 1) = cfg_uart[2];
    *((UINT8 *)&uart1_buad + 2) = cfg_uart[1];
    *((UINT8 *)&uart1_buad + 3) = cfg_uart[0];
    IE_UART1 = 0;
    SBAUD1 = 256 - FREQ_SYS / 16 / uart1_buad;
    IE_UART1 = 1;
}

void Uart1_ISR(void) interrupt INT_NO_UART1
{
    if (U1RI)  //收到数据
    {
        Ep1BufferI[Uart_Input_Point++] = SBUF1;
        UartByteCount++;                    //当前缓冲区剩余待取字节数
        if (Uart_Input_Point >= THIS_ENDP0_SIZE)
            Uart_Input_Point = 0;           //写入指针
        U1RI = 0;
    }
}
